app/views/users/show.html.erb


<strong>Wish_items</strong> <%= @user.wish_items.count %> <br/>
---
SELECT COUNT(*) FROM `wish_items` WHERE `wish_items`.`user_id` = 1