app/views/wish_items/_wish_item.html.erb

    <% @wish_items.each do |wish_item| %>
      <% user = wish_item.user rescue User.find(wish_item.user_id) %>
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 ORDER BY `users`.`id` ASC LIMIT 1