app/views/wish_items/index.html.erb


<% if @user.wish_items.any? %>
---
SELECT 1 AS one FROM `wish_items` WHERE `wish_items`.`user_id` = 3 ORDER BY created_at DESC LIMIT 1
SELECT `wish_items`.* FROM `wish_items` WHERE `wish_items`.`user_id` = 1