app/controllers/friendships_controller.rb

SELECT `friendships`.* FROM `friendships` WHERE `friendships`.`friend_id` = 8
SELECT id, name FROM `users` WHERE `users`.`id` IN (3, 4, 5)
---
  def index
    @user = current_user
    @friendships = @user.friendships
    @inverse_friendships = @user.inverse_friendships

	friend_id_list = []
	@friendships.each do |friendship|
	  friend_id_list << friendship.friend_id
	end
    @inverse_friendships.each do |friendship|
	  friend_id_list << friendship.user_id
	end
	friend_id_list = friend_id_list.uniq

	@friends_list = User.select('id, name').find(friend_id_list)

INSERT INTO `friendships` (`created_at`, `friend_id`, `updated_at`, `user_id`) VALUES ('2015-05-20 14:55:30', 2, '2015-05-20 14:55:30', 1)
---
  def create
    @friendship = current_user.friendships.build(:friend_id => params[:friend_id])
    respond_to do |format|
	  begin
        if @friendship.save

UPDATE `friendships` SET `friend_id` = 1, `updated_at` = '2015-05-20 15:00:39' WHERE `friendships`.`id` = 1
---
  def update
    respond_to do |format|
      if @friendship.update(friendship_params)

SELECT `friendships`.* FROM `friendships` WHERE `friendships`.`user_id` = 1 AND `friendships`.`id` = 1 LIMIT 1
DELETE FROM `friendships` WHERE `friendships`.`id` = 1
---
  def destroy
    @friendship = current_user.friendships.find(params[:id])
    @friendship.destroy

SELECT `friendships`.* FROM `friendships` WHERE `friendships`.`id` = 1 LIMIT 1
---
    def set_friendship
      @friendship = Friendship.find(params[:id])