app/controllers/users_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`name` = 'zmingshi' LIMIT 1
---
  def search
    @user = User.find_by_name(params[:name])

INSERT INTO `users` (`address`, `created_at`, `name`, `password_digest`, `updated_at`) VALUES ('北京市朝阳区十里堡北区炫特嘉园7号楼1401室', '2015-05-18 12:36:21', 'zmingshi', '$2a$10$TE/y4Q9DUD0.dZbiO99opOQiOWXSRQGJG9HNonfrpfvI39JhdJeh2', '2015-05-18 12:36:21')
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save

UPDATE `users` SET `password_digest` = '$2a$10$cBSAyWz8QK4hrAdRkouTbOgg4yMG4ne434vSrCu3/41gjhhzyIJ4W', `updated_at` = '2015-05-18 12:41:42' WHERE `users`.`id` = 3
---
  def update
    respond_to do |format|
      if @user.update(user_params)