app/controllers/wish_items_controller.rb

  def index
    @user = User.find(session[:user_id])
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 ORDER BY `users`.`id` ASC LIMIT 1