app/controllers/wish_items_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`id` = 2 ORDER BY `users`.`id` ASC LIMIT 1
---
  def item
    @user = User.find(params[:id])

SELECT `wish_items`.* FROM `wish_items` WHERE `wish_items`.`id` = 4 LIMIT 1
UPDATE `wish_items` SET `mark` = 3, `updated_at` = '2015-05-20 05:38:47' WHERE `wish_items`.`id` = 4
---
  def set_flag
    @wish_item = WishItem.find(params[:id])
	respond_to do |format|
	  if @wish_item.update_attribute(:flag, true)

SELECT `users`.* FROM `users` WHERE `users`.`id` IS NULL LIMIT 1
INSERT INTO `wish_items` (`created_at`, `flag`, `mark`, `title`, `updated_at`, `url`, `user_id`) VALUES ('2015-05-19 14:43:07', 1, 2, '我要上班了', '2015-05-19 14:43:07', 'http://item.jd.com/10943839.html', 1)
---
  def create
    @user = User.find_by(:id => params[:user_id])
	@wish_item = @user.wish_items.build(wish_item_params)
    #@wish_item = WishItem.new(wish_item_params)

    respond_to do |format|
      if @wish_item.save

DELETE FROM `wish_items` WHERE `wish_items`.`id` = 4
---
  def destroy
    @wish_item.destroy